[
    {
        "id": "work",
        "name": "Professional Experience",
        "content": [
            {
                "id": "bell",
                "location": "Bell Canada",
                "title": "Software Developer, Student - Hybrid",
                "startdate": "May 2022",
                "enddate": "Auguest 2024",
                "tags": ["java 70", "js 10", "html 10", "css 10", "spring 60", "mysql 30", "python 20", "git", "maven", "docker", "kubernetes"],
                "details": [
                    "Develop Java Spring Boot services to decouple dashboards, enhancing system efficiency.",
                    "Automate deployment of service stats to Kafka and Elastic, streamlining task management.",
                    "Lead team in creating Python FastAPI services, managing millions of phone numbers nationwide",
                    "Oversee OpenShift builds and deployments using Kubernetes and Docker for microservices."
                ]
            },
            {
                "id": "cse",
                "location": "Government of Canada - Communications Security Establishment - Remote",
                "title": "Software Developer Intern",
                "startdate": "September 2022",
                "enddate": "December 2022",
                "tags": ["cs 40", "vb 40", "dotnet 20", "git"],
                "details": [
                    "Developed RPA services, cutting document management time, enhancing workflow efficiency.",
                    "Created HTTP request libraries for future API use, streamlining integration.",
                    "Led automation projects, modernizing document access, boosting operational efficiency.",
                    "Adapted to UI-Path swiftly, meeting project requirements effectively."
                ]
            }
        ]
    },
    {
        "id": "school",
        "name": "Education",
        "content": [
            {
                "id": "otu",
                "location": "Ontario Tech University",
                "title": "Bachelors of Science, Computer Science",
                "startdate": "September 2020",
                "enddate": "December 2024",
                "tags": ["java", "python", "cpp", "c", "html", "vue", "js", "docker", "kotlin", "mysql", "postgres", "git", "gradle", "express", "cs"],
                "details": [
                    "Gained expertise in relational database design, adhering to industry standards for creating and managing rational databases.",
                    "Learned best practices in version control, including repository organization, branching strategies, and code review processes within large development teams.",
                    "Developed skills in enterprise and business software development, focusing on building scalable and efficient systems.",
                    "Completed projects involving integrated systems, including chat software, blogging platforms, and other software solutions.",
                    "Participated in student union activities, such as E-Sports tournaments, onboarding events, and campus gatherings, fostering collaboration and leadership skills."
                ]
            }
        ]
    }
]