[
    {
        "id": "work",
        "name": "Professional Experience",
        "content": [
            {
                "id": "bell",
                "location": "Bell Canada",
                "title": "Software Developer, Student - Hybrid",
                "startdate": "May 2022",
                "enddate": "Auguest 2024",
                "tags": ["java 70", "js 10", "html 10", "css 10", "spring 60", "mysql 30", "python 20", "git", "maven", "docker", "kubernetes"],
                "details": [
                    "Designed and implemented Spring Boot solutions, ensuring compliance with RESTful practices to deliver reliable services. Documented best practices to improve developer workflows, boosting project consistency and efficiency.",
                    "Managed MonoRepo systems for integrated Docker builds and automated GitLab CI/CD pipelines, enabling seamless deployment of microservices and reducing overhead.",
                    "Automated the publication of service statistics to Kafka and Elastic, streamlining task allocation and improving business team productivity.",
                    "Led a student team to develop API services for phone management, enhancing client interactions and streamlining internal processes."
                ]
            },
            {
                "id": "cse",
                "location": "Government of Canada - Remote",
                "title": "Software Developer Intern",
                "startdate": "September 2022",
                "enddate": "December 2022",
                "tags": ["cs 40", "vb 40", "dotnet 20", "git"],
                "details": [
                    "I was hired as a Co-Op student and later transitioned to a Part-Time role in the Business Sector to continue academic studies while contributing professionally.",
                    "Onboarded and trained in using UIPath, a robotic process automation (RPA) tool designed to replicate human interactions with computers for tasks such as data entry and email automation.",
                    "Tasked with optimizing the organization's Data Library by transitioning from a reliance on screen-clicks to more efficient API calls, enhancing the library's performance and reliability.",
                    "Successfully implemented improvements that significantly reduced task execution times by eliminating delays caused by screen interactions."
                ]
            }
        ]
    },
    {
        "id": "school",
        "name": "Education",
        "content": [
            {
                "id": "otu",
                "location": "Ontario Tech University",
                "title": "Bachelors of Science, Computer Science",
                "startdate": "September 2020",
                "enddate": "December 2024",
                "tags": ["java", "python", "cpp", "c", "html", "vue", "js", "docker", "kotlin", "mysql", "postgres", "git", "gradle", "express", "cs"],
                "details": [
                    "Gained expertise in relational database design, adhering to industry standards for creating and managing rational databases.",
                    "Learned best practices in version control, including repository organization, branching strategies, and code review processes within large development teams.",
                    "Developed skills in enterprise and business software development, focusing on building scalable and efficient systems.",
                    "Completed projects involving integrated systems, including chat software, blogging platforms, and other software solutions.",
                    "Participated in student union activities, such as E-Sports tournaments, onboarding events, and campus gatherings, fostering collaboration and leadership skills."
                ]
            }
        ]
    }
]